# 1
# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на позиции с нечетным индексом.
# Пример:
# [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12
s = []

while True:
    n = input("Введите число (для окончаня ввода - пустое значение): ")
    if n != "":
        if n.isdigit():        
            s.append(int(n))  
        else:
            print("Вы ввели не число!")
    else:
        break

sum = 0

for i in range(len(s)):
    if i % 2 > 0:
        sum += s[i]

print(f'Сумма элементов списка, стоящих на позиции с нечетным индексом = {sum}')

#-------------------------------------------------------------------------------------------------------------------------------------

# 2
#  Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# [2, 3, 4, 5, 6] => [12, 15, 16];
# [2, 3, 5, 6] => [12, 15]


s1 = [] 

while True:
    n = input("Введите число (для окончаня ввода - пустое значение): ")
    if n != "":
        if n.isdigit():       
            s1.append(int(n))   
        else:
            print("Вы ввели не число!")
    else:
        break

s2 = [] 

l2 = round((len(s1) + 1) / 2) 

for i in range(l2):   
    n = s1[i]             
    m = s1[len(s1)-1-i]   

    s2.append(n * m)      

print(s2)

#-------------------------------------------------------------------------------------------------------------------------------------

# 3
# Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов, отличной от 0.
# Пример:
# [1.1, 1.2, 3.1, 5, 10.01] => 0.19
s = [1.1, 1.2, 3.1, 5, 710.01]

min = -1
max = 0

for i in range(len(s)):

    n_str = str(s[i])           
    pos = n_str.find('.')       

    if pos > 0:
        n_str = n_str[pos:]   
        n_str = '0' + n_str   
        drob = float(n_str)   

        if drob > max:
            max = drob

        if min == -1:         
            min = drob

        if drob < min:
            min = drob

print (max-min)
#-------------------------------------------------------------------------------------------------------------------------------------


# 4
# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# 45 -> 101101
# 3 -> 11
# 2 -> 10


n = input("Введите десятичное число: ")

if not n.isdigit():        
    print("Вы ввели не число!")
    exit()
else:
    n = int(n)

ostatok = ""

while n > 0:
    ostatok = str(n % 2) + ostatok
    n = n // 2

print(f"Двоичное число: {ostatok}")

#-------------------------------------------------------------------------------------------------------------------------------------


# 5
# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример:
# для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] Негафибоначчи

k = 8

fib1 = 1
fib2 = 1

f = []
f.append(0)
f.append(fib1)
f.append(fib2)
 
for i in range(k-2):

    fib_ = fib2
    fib2 = fib1 + fib2
    fib1 = fib_

    f.append(fib2)

print(f)

#-------------------------------------------------------------------------------------------------------------------------------------
